app/controllers/books_controller.rb

  def index
    @books = Book.all
    @book = Book.new
    @users = User.all
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users"

  def show
    @user = @book.user_id
    @book = Book.new
    @books = Book.find(params[ :id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id

    if @book.save
    redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "opinion", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["opinion", "aaa"], ["created_at", "2018-10-22 10:05:01.499454"], ["updated_at", "2018-10-22 10:05:01.499454"], ["user_id", "4"]]
SELECT "books".* FROM "books"

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "opinion" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["opinion", "10テスト のテスト"], ["updated_at", "2018-10-24 08:32:18.029869"], ["id", 19]]