app/controllers/users_controller.rb

  def index
  	@users = User.all
  	@books = Book.all
---
SELECT "users".* FROM "users"
SELECT "books".* FROM "books"

  def show
    @book = Book.new
    # if @book.save
    # redirect_to action: 'show'
    # end
  	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    if @user.save
---
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ふふふ"], ["profile_image_id", nil], ["introduction", "ふふふ"], ["updated_at", "2018-10-22 06:22:32.837626"], ["id", 3]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "asa"], ["profile_image_id", nil], ["introduction", "aaa"], ["updated_at", "2018-10-24 07:54:46.821996"], ["id", 10]]